
import './style.css'

//! ================================================

//? №1
//? Сделайте три переменные: одну строковую, одну числовую и одну логическую.

// const num: number = 25;
// const str: string = 'Andrii';
// const bool: boolean = true;


//! ================================================

//? №2
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: number = 123;
//? test = 'abc';
//? console.log(test);

// Відповідь: Буде помилка.

//! ================================================

//? №3
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: string = 'abc';
//? test = 123;
//? console.log(test);

// Відповідь:  помилка.

//! ================================================

//? №3
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: string = 'abc';
//? test = '123';
//? console.log(test);

// Відповідь: 123

//! ================================================

//? №4
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: string = 'abc';
//? test = true;
//? console.log(test);

// Відповідь:  помилка.

//! ================================================

//? №5
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: string = 123;
//? test = 'abc';
//? console.log(test);

// Відповідь:  помилка.

//! ================================================

//? №6
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: string = '123';
//? test = '456';
//? console.log(test);

// Відповідь: 456

//! ================================================

//? №7
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: number = '123';
//? test = '456';
//? console.log(test);

// Відповідь:  помилка.

//! ================================================

//? №8
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: number = 123;
//? test = 456;
//? console.log(test);

// Відповідь: 456

//! ================================================

//? №9
//? Не запуская код определите каким будет результат выполнения кода:
//? let test: boolean = true;
//? test = false;
//? console.log(test);

// Відповідь: false

//! ================================================

//? №10
//? Не запуская код определите каким будет результат выполнения кода:
//? let test1: number = 123;
//? let test2: number = 456;
//? console.log(test1 + test2);

// Відповідь: 579

//! ================================================

//? №11
//? Не запуская код определите каким будет результат выполнения кода:
//? let test1: string = '123';
//? let test2: string = '456';
//? console.log(test1 + test2);

// Відповідь: 123456

//! ================================================

//? №12
//? Не запуская код определите каким будет результат выполнения кода:
//? let test1: string = '123';
//? let test2: string = '456';
//? let test3: number = test1 + test2;
//? console.log(test3);

// Відповідь:  помилка.

//! ================================================

//? №13
//? Не запуская код определите каким будет результат выполнения кода:
//? let test1: number = 123;
//? let test2: number = 456;
//? let test3: string = test1 + test2;
//? console.log(test3);

// Відповідь:  помилка.

//! ================================================

// №5⊗jstsPmBsOp

// Не запуская код определите каким будет результат выполнения кода:

// let test1: number = 123;
// let test2: number = 456;

// let test3: string = test1 + ' ' + test2;
// console.log(test3);
// №6⊗jstsPmBsOp

// Не запуская код определите каким будет результат выполнения кода:

// let test1: number = 123;
// let test2: number = 456;
// let test3: string = '!';

// let test4: string = test1 + test2 + test3;
// console.log(test4);
// №7⊗jstsPmBsOp

// Не запуская код определите каким будет результат выполнения кода:

// let test1: number = '123';
// let test2: number = '456';

// console.log(test1 + test2);
// №8⊗jstsPmBsOp

// Не запуская код определите каким будет результат выполнения кода:

// let test1: number = +'123';
// let test2: number = +'456';

// console.log(test1 + test2);
// №9⊗jstsPmBsOp

// Не запуская код определите каким будет результат выполнения кода:

// let test: string = '1';
// test += 1;

// console.l

// №1⊗jstsPmBsAr

// С помощью первого способа укажите тип данных в следующем массиве:

// let arr = [1, 2, 3, 4, 5];
// №2⊗jstsPmBsAr

// С помощью второго способа укажите тип данных в следующем массиве:

// let arr = [1, 2, 3, 4, 5];

// №1⊗jstsPmBsOb

// Сделайте объект, содержащий год, месяц и день в соответствующих ключах.

// №1⊗jstsPmBsOTC

// Не запуская код определите каким будет результат выполнения кода:

// let date = {year: 2025, month: 12, day: 31};
// date = '2025-12-31';

// console.log(date);


// №1⊗jstsPmBsOSC

// Не запуская код определите каким будет результат выполнения кода:

// let date = {year: 2025, month: 12, day: 31};
// date = {year: 2025, month: 12};
// №2⊗jstsPmBsOSC

// Не запуская код определите каким будет результат выполнения кода:

// let date = {year: 2025, month: 12, day: 31};
// date = {year: 2025, month: 12, date: 7};



// №1⊗jstsPmBsOVTC

// Не запуская код определите каким будет результат выполнения кода:

// let date = {year: 2025, month: 12, day: 31};
// date.month = '12';

// console.log(date);
// №2⊗jstsPmBsOVTC

// Не запуская код определите каким будет результат выполнения кода:

// let product = {code: '123', name: 'apple', price: 12};
// product.code = 123;

// console.log(product);
// №3⊗jstsPmBsOVTC

// Не запуская код определите каким будет результат выполнения кода:

// let product = {code: '123', name: 'apple', price: 12 };
// product.price = 123;

// console.log(product);
// №4⊗jstsPmBsOVTC

// Не запуская код определите каким будет результат выполнения кода:

// let user = {name: 'john', admin: true};
// user.admin = 'false';

// console.log(user);



// №1⊗jstsPmBsLF

// Перепишите следующий код через TypeScript:

// let res = 0;

// for (let i = 0; i < 100; i++) {
// 	res += i;
// }

// console.log(res);


// №1⊗jstsPmBsLFO

// Перепишите следующий код через TypeScript:

// let arr = [1, 2, 3, 4, 5];
// let res = 0;

// for (let elem of arr) {
// 	res += elem;
// }

// console.log(res);



// №1⊗jstsPmBsLFI

// Перепишите следующий код через TypeScript:

// let obj = {a: 1, b: 2, c: 3};
// let res = 0;

// for (let key in obj) {
// 	let elem = obj[key];
// 	res += elem;
// }

// console.log(res);


// №1⊗jstsPmBsFn

// Укажите тип результату и параметрам функции:

// function sum(x, y) {
// 	return x + y;
// }
// №2⊗jstsPmBsFn

// Укажите тип результату и параметрам функции:

// function sum(arr) {
// 	let res = 0;
	
// 	for (let num of arr) {
// 		res += num;
// 	}
	
// 	return res;
// }




// №1⊗jstsPmBsFER

// Укажите тип возвращаемого значения:

// function func(text: string) {
// 	console.log(text);
// }


// №1⊗jstsPmBsTA

// Не запуская код определите каким будет результат выполнения кода:

// let test1: number = 123;
// let test2: string = 'abc';
// let test3: any;

// test3 = test1;
// console.log(test3);

// test3 = test2;
// console.log(test3);


// №1⊗jstsPmBsTAA

// Перепишите следующий код через TypeScript:

// let arr = [1, '2', '3', 4, 5];
// console.log(arr);



// №1⊗jstsPmBsTU

// Сделайте переменную, которая может быть либо числом, либо null.

// №2⊗jstsPmBsTU

// Сделайте переменную, которая может быть либо числом, либо строкой, либо логической.



// №1⊗jstsPmBsTA

// Создайте новый тип, объединяющий null и undefined.

// №2⊗jstsPmBsTA

// Создайте новый тип, объединяющий логический тип, null и undefined.


// №1⊗jstsPmBsSLT

// Сделайте так, чтобы переменная могла принимать одно из трех значений: 'error', 'warning' или 'success'.



// №1⊗jstsPmBsSLA

// Сделайте тип данных, который будет разрешать переменной принимать одно из трех значений: 'error', 'warning' или 'success'.



// №1⊗jstsPmTpInr

// Сделайте кортеж, который будет хранить номер года и номер месяца.

// №2⊗jstsPmTpInr

// Сделайте кортеж, который будет хранить номер года и название месяца.

// №3⊗jstsPmTpInr

// Сделайте кортеж, который будет хранить номер года, номер месяца и номер дня.



// №1⊗jstsPmTpCh

// Расскажите, каким будет результат выполнения следующего кода:

// let time: [number, number, number] = [12, 59, 59];
// time[0] = 13;
// console.log(time);
// №2⊗jstsPmTpCh

// Расскажите, каким будет результат выполнения следующего кода:

// let time: [number, number, number] = [12, 59, 59];
// time[0] = '01';
// console.log(time);


// №1⊗jstsPmTpRo

// Расскажите, каким будет результат выполнения следующего кода:

// let time: readonly [number, number, number] = [12, 59, 59];
// time[0] = 13;
// console.log(time);

// №1⊗jstsPmTpOE

// Заполните данными следующий кортеж:

// let date: [number, number?, number?];


// №1⊗jstsPmTpDst

// Дан следующий кортеж:

// let time: [number, number, number] = [12, 59, 59];
// Разбейте части времени в отдельные переменные.


// №1⊗jstsPmTpFl

// Заполните данными следующий кортеж:

// let tpl: [string, string, ...number[]];
// №2⊗jstsPmTpFl

// Заполните данными следующий кортеж:

// let tpl: [number, boolean, ...string[]];


// №1⊗jstsPmEnInr

// Сделайте перечисление, содержащее дни недели.


// №1⊗jstsPmEnKe

// Расскажите, каким будет результат выполнения следующего кода:

// enum Fruits { Apples, Bananas, Oranges, Grapes };
// let myFruit: string = Fruits[2];
// console.log(myFruit);


// №1⊗jstsPmEnVl

// Расскажите, каким будет результат выполнения следующего кода:

// enum Fruits { Apples, Bananas, Oranges, Grapes };
// let myFruit: number = Fruits.Apples;
// console.log(myFruit);

// №1⊗jstsPmEnEK

// Сделайте перечисление Months и задайте в нем номера всем месяцам в году. Выведите в консоль первый и пятый месяцы.

// №1⊗jstsPmEnSK

// Расскажите, каким будет результат выполнения следующего кода:

// enum Fruits { Apples = 1, Bananas, Oranges, Grapes };
// let myFruit: Fruits = Fruits.Grapes;
// console.log(myFruit);


// №1⊗jstsPmEnSt

// Сделайте перечисление с названиями дней недели.

// №2⊗jstsPmEnSt

// Сделайте перечисление с названиями месяцев.


// №1⊗jstsPmIbDt

// Сделайте переменную, которая будет содержать объект с датой.


// №1⊗jstsPmIbRg

// Сделайте переменную, которая будет содержать регулярное выражение.


// №1⊗jstsPmIbHE

// Сделайте переменную, которая будет содержать promise.

// №2⊗jstsPmIbHE

// Сделайте переменную, которая будет содержать DOM элемент.

// №3⊗jstsPmIbHE

// Сделайте переменную, которая будет содержать ссылку на тег ul.


// №1⊗jstsPmIbCl

// Сделайте переменную, которая будет содержать коллекцию Map.

// №2⊗jstsPmIbCl

// Сделайте переменную, которая будет содержать коллекцию Set.

// №3⊗jstsPmIbCl

// Сделайте переменную, которая будет содержать коллекцию NodeList.

// №4⊗jstsPmIbCl

// Сделайте переменную, которая будет содержать коллекцию HTMLCollection.



// №1⊗jstsPmDSOS

// Не запуская код определите каким будет результат выполнения кода:

// let date: {year: number, month: number, day: number};
// date = {year: 2025, month: 12, day: '01'};


// №1⊗jstsPmDSOP

// Не запуская код определите каким будет результат выполнения кода:

// let date = {year: number, month: number, day?: number};
// date = {year: 2025, month: 12};


// №1⊗jstsPmDSIn

// Создайте три объекта, реализующих следующий интерфейс:

// interface Employee {
// 	name: string,
// 	age: number,
// 	salaryday: number
// }
// №2⊗jstsPmDSIn

// Создайте три объекта, реализующих следующий интерфейс:

// interface Time {
// 	hour: number,
// 	minute: number,
// 	second: number
// }


// №1⊗jstsPmDSAIO

// Сделайте объект со страной, содержащий название страницы и массив ее городов.


// №1⊗jstsPmDSOAI

// Сделайте объект со страной, содержащий название страницы и массив ее городов.


// №1⊗jstsPmDSCO

// Дан объект:

// let event = {
// 	name: 'my new event',
// 	time: {
// 		start: '2025-11-01',
// 		finish: '2025-12-31'
// 	}
// };
// Сделайте интерфейс, описывающий структуру этого объекта.

// №2⊗jstsPmDSCO

// Дан объект:

// let employee {
// 	name: 'andrew',
// 	potision: {
// 		name: 'programmer'
// 		salary: 1000,
// 	}
// 	addr: {
// 		country: 'belarus',
// 		city: 'minsk'
// 	}
// };
// Сделайте интерфейс, описывающий структуру этого объекта.



// №1⊗jstsPmDSOOb

// Дан объект:

// let employee {
// 	name: 'andrew',
// 	potision: {
// 		name: 'programmer'
// 		salary: 1000,
// 	},
// 	addr: {
// 		country: 'belarus',
// 		city: 'minsk'
// 	}
// };
// Сделайте интерфейс, описывающий структуру этого объекта. Вынесите вложенные объекты в отдельные интерфейсы.

// №2⊗jstsPmDSOOb

// Дан объект:

// let user: User = {
// 	name: 'john',
// 	age: 30,
// 	parents: {
// 		mother: {
// 			name: 'jane',
// 			age: 30,
// 			parents: null
// 		},
// 		father: {
// 			name: 'eric',
// 			age: 30,
// 			parents: null
// 		}
// 	}
// }
// Сделайте интерфейс, описывающий структуру этого объекта. Вынесите вложенные объекты в отдельные интерфейсы.



// №1⊗jstsPmDSAOO

// Сделайте массив, элементы которого будут регулярными выражениями.

// №2⊗jstsPmDSAOO

// Сделайте массив, элементы которого будут промисами.

// №3⊗jstsPmDSAOO

// Сделайте интерфейс, описывающий работника. Сделайте массив, состоящий из объектов с этими работниками.




// №1⊗jstsPmFnPQ

// Дана следующая функция:

// function func(a: number, b: number) {
// 	return a + b;
// }
// Расскажите, каким будет результат каждого из следующих вызовов функции:

// func(1);
// func(1, 2, 3);
// func(1, 2);



// №1⊗jstsPmFnOP

// Сделайте функцию, которая принимать параметрами день, месяц и год, и возвращать день недели, соответствующий этой дате. Пусть все три параметра будут не обязательными. Если какой-то параметр не передан, он должен принять значение, соответствующее текущей дате.



// №1⊗jstsPmFnDPV

// Сделайте функцию, которая будет возводить число в заданную степень. Пусть первым параметром функция принимает число, а вторым - степень. Пусть второй параметр будет необязательным, и по умолчанию функция возводит число во вторую степень.


// №1⊗jstsPmFnRP

// Сделайте функцию, которая параметрами принимает любое количество чисел, а возвращает их сумму.

// №1⊗jstsPmFnFT

// Укажите переменной тип функции:

// let func = function(text: string): void {
// 	alert(text);
// };



// №1⊗jstsPmFnFT

// Дан следующий тип:

// type Func = (x: number, y: number, z: number) => number;
// Сделайте функцию данного типа. Пусть функция параметром получает три числа, а своим результатом возвращает сумму этих чисел.

// №2⊗jstsPmFnFT

// Объявите тип функции, параметром принимающей число и массив чисел, а результатом возвращающий массив чисел.



// №1⊗jstsPmFnClb

// Расскажите, каким будет результат выполнения следующего кода:

// type Func = (num: number) => number;

// function make(arr: number[], func: Func): number[] {
// 	return arr.map(function(elem: number) {
// 		return func(elem);
// 	});
// }

// let res: number[] = make([1, 2, 3], function(num: number): number {
// 	return num ** 2;
// });

// console.log(res);
// №2⊗jstsPmFnClb

// Найдите и исправьте ошибки, допущенные в следующем коде:

// type Func = (num: number) => number;

// function make(arr: number, func: Func): number {
// 	let sum = 0;
	
// 	for (let elem of arr) {
// 		sum += func(elem);
// 	}
	
// 	return sum;
// }

// let res: number[] = make([1, 2, 3], function(num): string {
// 	return num ** 2;
// });

// console.log(res);




// №1⊗jstsPmFnAF

// Переделайте следующую функцию на стрелочную:

// let func = function(num1: number, num2: number): number {
// 	return num1 + num2;
// }
// №2⊗jstsPmFnAF

// Переделайте следующую функцию на стрелочную:

// let func = function(str: string): string[] {
// 	return str.split('');
// }
// №3⊗jstsPmFnAF

// Перепишите следующий JavaScript код на TypeScript вариант:

// let arr = [1, 2, 3];
// let res = arr.map(num => num ** 2);

// console.log(res);



// №1⊗tsSpOpCls

// Объявите класс Employee.


// №1⊗tsSpOpCls

// Создайте два объекта класса Employee.


// №1⊗tsSpOpCP

// Создайте класс Student со свойствами name и age.


// №1⊗tsSpOpCM

// Создайте класс Student со свойствами name и age. Добавьте методы для получения и изменения этих свойств.

// №1⊗tsSpOpCM
// Создайте класс Employee, в конструктор которого передайте имя, фамилию, возраст и зарплату работника.

// №1⊗tsSpOpCM
// Создайте класс Employee, который наследует от класса User.


// №1⊗tsSpOpAMPb

// Сделайте класс User, который будет содержать публичные свойства с именем и годом рождения пользователя. Сделайте публичный метод getAge, который будет получать возраст пользователя по году его рождения.



// №1⊗tsSpOpAMPr

// Сделайте класс User, содержащий приватные свойства с именем и возрастом. Пусть их начальные значения задаются через конструктор.

// №2⊗tsSpOpAMPr

// В вашем классе User сделайте публичные методы getName и getAge, позволяющие получить значения соответствующих приватных свойств.

// №3⊗tsSpOpAMPr

// В вашем классе User сделайте публичные методы setName и setAge, позволяющие изменить значения соответствующих приватных свойств.



// №1⊗tsSpOpAMPrt

// Дан следующий класс:

// class User {
// 	protected name: string;
// 	protected surn: string;
	
// 	constructor(name: string, surn: string) {
// 		this.name = name;
// 		this.surn = surn;
// 	}
// }
// Унаследуйте от этого класса класс Employee, который добавит защищенное свойство salary, а также геттеры всех свойств, как своих, так и унаследованных.




// №1⊗tsSpOpAMRd

// Задайте классу User свойство age, доступное только для чтения. Создайте объект данного класса и выведите его возраст на экран.



// №1⊗tsSpOpAcs

// Сделайте класс User, содержащий приватные свойства с именем и возрастом. Сделайте аксессоры этих свойств.

// №2⊗tsSpOpAcs

// Модифицируйте сеттер возраста так, чтобы можно было задать возраст от 0 до 120. Если же будет указано иное значение, должно выбрасываться исключение.




// №1⊗tsSpOpSPr

// В класс Student добавьте статическое свойство specialty. Выведите данное свойство без объявления объекта.



// №1⊗tsSpOpSPO

// В класс Student добавьте статическое свойство university. Выведите данное свойство без объявления объекта.



